УТ_для_edt.РасширениеСмарт/src/Catalogs/ПретензииКлиентов/ПретензииКлиентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="7d3ce2db-bc30-4d21-9d2a-fed41a8f8e49">
  <name>ПретензииКлиентов</name>
  <objectBelonging>Adopted</objectBelonging>
</mdclass:Catalog>

УТ_для_edt.РасширениеСмарт/src/Enums/ЮридическоеФизическоеЛицо/ЮридическоеФизическоеЛицо.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="02c342c8-4238-4cef-94d6-c869e4283540">
  <name>ЮридическоеФизическоеЛицо</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="cd40689d-5647-4119-af23-963f3a2190c6">
    <name>ФизическоеЛицо</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

УТ_для_edt.РасширениеСмарт/src/Documents/ЗаявкаНаВозвратТоваровОтКлиента/ЗаявкаНаВозвратТоваровОтКлиента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ЗаявкаНаВозвратТоваровОтКлиента</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>ПеревозчикПартнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НалогообложениеНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Договор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ЗаполнятьЦеныЗаменяющихТоваровПоВозвращаемым</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НеОтгружатьЧастями</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПоступлениеОднойДатой</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Приоритет</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДокументРеализации</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ЧекККМ</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Партнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Соглашение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СпособКомпенсации</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НаправлениеДеятельности</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ЦенаВключаетНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаПоступления</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДополнительнаяИнформацияПоДоставке</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ЖелаемаяДатаОтгрузки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ДатаОтгрузки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>СпособДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>АдресДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ЗонаДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВремяДоставкиС</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ВремяДоставкиПо</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ОсобыеУсловияПеревозки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ОсобыеУсловияПеревозкиОписание</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>АдресДоставкиПеревозчика</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Сделка</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Менеджер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КонтактноеЛицо</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КартаЛояльности</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ГруппаФинансовогоУчета</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаСогласования</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ЖелаемаяДатаПоступления</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ДатаВозвратаДенежныхСредств</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВернутьМногооборотнуюТару</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СрокВозвратаМногооборотнойТары</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ТребуетсяЗалогЗаТару</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДополнительнаяИнформация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections>
    <name>ЗаменяющиеТовары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>Упаковка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ПроцентРучнойСкидки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>5</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>КодСтроки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>ДатаОтгрузки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <dateQualifiers>
            <dateFractions>Date</dateFractions>
          </dateQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>НоменклатураНабора</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ХарактеристикаНабора</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ВариантОбеспечения</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Серия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Содержание</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>1000</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>ВидЦены</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Цена</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ПроцентАвтоматическойСкидки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>5</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>СуммаАвтоматическойСкидки</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СуммаРучнойСкидки</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СуммаСНДС</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Отменено</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ПричинаОтмены</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СрокПоставки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВозвращаемыеТовары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>КоличествоУпаковок</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>СуммаСНДС</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>НоменклатураОприходование</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>КодСтроки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>НоменклатураНабора</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ХарактеристикаНабора</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Порча</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ХарактеристикаОприходование</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Назначение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СтатусУказанияСерий</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>2</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Серия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ВидЦены</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Цена</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ДатаПоступления</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <dateQualifiers>
            <dateFractions>Date</dateFractions>
          </dateQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Отменено</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ДокументРеализации</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЭтапыГрафикаОплаты</name>
    <objectBelonging>Adopted</objectBelonging>
  </tabularSections>
</mdclass:Document>

УТ_для_edt.РасширениеСмарт/src/Catalogs/ПретензииКлиентов/ManagerModule.bsl
//++ #1844 смарт: Мосолов 10.06.2024 //Доработка Претензии клиента
&ИзменениеИКонтроль("ДобавитьКомандыПечати")
Процедура смарт_ДобавитьКомандыПечати(КомандыПечати)

	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ПретензияКлиента";
	КомандаПечати.Представление = НСтр("ru = 'Претензия клиента'"); 
	
	#Вставка
	//++ #1844 смарт: Мосолов 10.06.2024 //Доработка Претензии клиента
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ПретензияКлиентаСНоменклатурой";
	КомандаПечати.Представление = НСтр("ru = 'Претензия клиента с номенклатурой'"); 
	//-- #1844 смарт: Мосолов 10.06.2024 
	#КонецВставки 
	
	#Вставка
	//++ #3900 смарт: Тимофеева 06.08.2025 / Создать печатную форму документа Претензия
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ПретензияКлиентаДляПодписи";
	КомандаПечати.Представление = НСтр("ru = 'Претензия клиента, для подписи'"); 
	//-- #3900 смарт: Тимофеева 06.08.2025 
	#КонецВставки

КонецПроцедуры //-- #1844 смарт: Мосолов 10.06.2024 

//++ #1844 смарт: Мосолов 10.06.2024 //Доработка Претензии клиента
&ИзменениеИКонтроль("Печать")
Процедура смарт_Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода)

	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПретензияКлиента") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,
		"ПретензияКлиента",
		НСтр("ru = 'Претензия клиента'"),
		СформироватьПечатнуюФорму(МассивОбъектов, ОбъектыПечати));

		ФормированиеПечатныхФорм.ЗаполнитьПараметрыОтправки(ПараметрыВывода.ПараметрыОтправки, МассивОбъектов, КоллекцияПечатныхФорм);
	КонецЕсли;
	
	#Вставка
	//++ #1844 смарт: Мосолов 10.06.2024 //Доработка Претензии клиента
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПретензияКлиентаСНоменклатурой") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,
			"ПретензияКлиентаСНоменклатурой",
			НСтр("ru = 'Претензия клиента с номенклатурой'"),
			смартСформироватьПечатнуюФормуСНоменклатурой(МассивОбъектов, ОбъектыПечати));

		ФормированиеПечатныхФорм.ЗаполнитьПараметрыОтправки(ПараметрыВывода.ПараметрыОтправки, МассивОбъектов, КоллекцияПечатныхФорм);
		
	КонецЕсли;
	//-- #1844 смарт: Мосолов 10.06.2024 
	#КонецВставки 
	
	#Вставка
	//++ #3900 смарт: Тимофеева 06.08.2025 / Создать печатную форму документа Претензия
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПретензияКлиентаДляПодписи") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,
			"ПретензияКлиентаДляПодписи",
			НСтр("ru = 'Претензия клиента, для подписи'"),
			смартСформироватьПечатнуюФормуДляПодписи(МассивОбъектов, ОбъектыПечати));

		ФормированиеПечатныхФорм.ЗаполнитьПараметрыОтправки(ПараметрыВывода.ПараметрыОтправки, МассивОбъектов, КоллекцияПечатныхФорм);
		
	КонецЕсли;
	//-- #3900 смарт: Тимофеева 06.08.2025 
	#КонецВставки  
	
КонецПроцедуры //-- #1844 смарт: Мосолов 10.06.2024

//++ #1844 смарт: Мосолов 10.06.2024 //Доработка Претензии клиента
Функция смартСформироватьПечатнуюФормуСНоменклатурой(ПретензияКлиента, ОбъектыПечати)
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	Запрос = Новый Запрос;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПретензииКлиентов.Ссылка КАК Ссылка,
	|	ПретензииКлиентов.Наименование КАК Наименование,
	|	ВЫБОР
	|		КОГДА ПретензииКлиентов.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПретензийКлиентов.Зарегистрирована)
	|				ИЛИ ПретензииКлиентов.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПретензийКлиентов.Обрабатывается)
	|			ТОГДА ПРЕДСТАВЛЕНИЕ(ПретензииКлиентов.Статус)
	|		ИНАЧЕ &Рассмотрена
	|	КОНЕЦ КАК ПредставлениеСтатус,
	|	ПретензииКлиентов.Статус КАК Статус,
	|	ПретензииКлиентов.ОписаниеПретензии КАК ОписаниеПретензии,
	|	ПретензииКлиентов.РезультатыОтработки КАК РезультатыОтработки,
	|	ПретензииКлиентов.ДатаРегистрации КАК ДатаРегистрации,
	|	ПретензииКлиентов.ДатаОкончания КАК ДатаОкончания,
	|	ПретензииКлиентов.Ответственный КАК Ответственный
	|ИЗ
	|	Справочник.ПретензииКлиентов КАК ПретензииКлиентов
	|ГДЕ
	|	ПретензииКлиентов.Ссылка = &ПретензияКлиента";
	
	ЗапросТовары = Новый Запрос;
	ЗапросТовары.Текст =
	"ВЫБРАТЬ
	|	ПретензииКлиентовсмартТовары.Номенклатура.Артикул КАК Артикул,
	|	ПретензииКлиентовсмартТовары.Номенклатура КАК Номенклатура,
	|	ПретензииКлиентовсмартТовары.Серия КАК Серия,
	|	ПретензииКлиентовсмартТовары.Количество КАК Количество,
	|	ПретензииКлиентовсмартТовары.НомерСтроки КАК НомерСтроки
	|ИЗ
	|	Справочник.ПретензииКлиентов.смартТовары КАК ПретензииКлиентовсмартТовары
	|ГДЕ
	|	ПретензииКлиентовсмартТовары.Ссылка = &ПретензияКлиента";
	
	Если ТипЗнч(ПретензияКлиента) = Тип("Массив") Тогда
		Запрос.УстановитьПараметр("ПретензияКлиента", ПретензияКлиента[ПретензияКлиента.Количество() - 1]);
		ЗапросТовары.УстановитьПараметр("ПретензияКлиента", ПретензияКлиента[ПретензияКлиента.Количество() - 1]);
	Иначе
		Запрос.УстановитьПараметр("ПретензияКлиента", ПретензияКлиента);
		ЗапросТовары.УстановитьПараметр("ПретензияКлиента", ПретензияКлиента);
	КонецЕсли;
	Запрос.УстановитьПараметр("Рассмотрена", НСтр("ru = 'Рассмотрена'"));
	
	смартЗаполнитьТабличныйДокументПретензияКлиентаСНоменклатурой(ТабличныйДокумент, Запрос, ЗапросТовары, ОбъектыПечати);
	
	Если ПривилегированныйРежим() Тогда
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	
	Возврат ТабличныйДокумент;
	
КонецФункции //-- #1844 смарт: Мосолов 10.06.2024

 
//++ #1844 смарт: Мосолов 10.06.2024 //Доработка Претензии клиента
Процедура смартЗаполнитьТабличныйДокументПретензияКлиентаСНоменклатурой(ТабличныйДокумент, Запрос, ЗапросТовары, ОбъектыПечати) Экспорт
	
	ДанныеПечати = Запрос.Выполнить().Выбрать();
	ДанныеПечати.Следующий();
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Справочник.ПретензииКлиентов.ПФ_MXL_ПретензияКлиентаСНоменклатурой");

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");

	ОбластьЗаголовок.Параметры.ТекстЗаголовка = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ДанныеПечати.Наименование + " %1 " + Формат(ДанныеПечати.ДатаРегистрации,"ДЛФ=DD"),НСтр("ru='от'"));
	
	ШтрихкодированиеПечатныхФорм.ВывестиШтрихкодВТабличныйДокумент(ТабличныйДокумент, Макет, ОбластьЗаголовок, ДанныеПечати.Ссылка);
	ТабличныйДокумент.Вывести(ОбластьЗаголовок);
	
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ЗаполнитьЗначенияСвойств(ОбластьШапка.Параметры, ДанныеПечати);
	ТабличныйДокумент.Вывести(ОбластьШапка);
	
	Если ДанныеПечати.Статус = Перечисления.СтатусыПретензийКлиентов.Удовлетворена 
		ИЛИ ДанныеПечати.Статус = Перечисления.СтатусыПретензийКлиентов.НеУдовлетворена Тогда
	
		ОбластьРассмотрение = Макет.ПолучитьОбласть("Рассмотрение");
		ЗаполнитьЗначенияСвойств(ОбластьРассмотрение.Параметры, ДанныеПечати);
		ТабличныйДокумент.Вывести(ОбластьРассмотрение);
	
	КонецЕсли;  
	
	ДанныеПечатиТовары = ЗапросТовары.Выполнить().Выбрать();
	
	Если ДанныеПечатиТовары.Количество() Тогда
		
		ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
		ТабличныйДокумент.Вывести(ОбластьШапкаТаблицы); 
		
		Пока ДанныеПечатиТовары.Следующий() Цикл 
			
			ОбластьСтрокаТаблицы = Макет.ПолучитьОбласть("СтрокаТаблицы");
			ЗаполнитьЗначенияСвойств(ОбластьСтрокаТаблицы.Параметры, ДанныеПечатиТовары);
			ТабличныйДокумент.Вывести(ОбластьСтрокаТаблицы);
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры //-- #1844 смарт: Мосолов 10.06.2024

//++ #Б2802 смарт: Шляпников 15.04.2025 / Изменение справочника "Претензия клиента"
Процедура ДобавитьКомандыСозданияНаОсновании(КомандыСозданияНаОсновании, Параметры) Экспорт 
	
	Документы.ЗаявкаНаВозвратТоваровОтКлиента.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	
КонецПроцедуры 

//++ #3900 смарт: Тимофеева 06.08.2025 / Создать печатную форму документа Претензия
Функция смартСформироватьПечатнуюФормуДляПодписи(МассивОбъектов, ОбъектыПечати)
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	ДанныеДляПечати = смартПолучитьДанныеДляПечатнойФормыПретензияДляПодписи(МассивОбъектов);	
	смартЗаполнитьТабличныйДокументПретензияКлиентаДляПодписи(ТабличныйДокумент, ДанныеДляПечати, ОбъектыПечати);
	
	Если ПривилегированныйРежим() Тогда
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

Процедура смартЗаполнитьТабличныйДокументПретензияКлиентаДляПодписи(ТабличныйДокумент, ДанныеДляПечати, ОбъектыПечати) Экспорт
	
	РезультатПоШапке			= ДанныеДляПечати.РезультатПоШапке;
	РезультатПоТабличнойЧасти 	= ДанныеДляПечати.РезультатПоТабличнойЧасти;
	РезультатПоРеализациям	 	= ДанныеДляПечати.РезультатПоРеализациям;
		
	Макет = УправлениеПечатью.МакетПечатнойФормы("Справочник.ПретензииКлиентов.ПФ_MXL_ПретензияКлиентаДляПодписи");
    ОбластьЗаголовок 		= Макет.ПолучитьОбласть("Заголовок");
	ОбластьЗаголовокУПД		= Макет.ПолучитьОбласть("ЗаголовокУПД");
	ОбластьСтрокаТаблицы 	= Макет.ПолучитьОбласть("Детали");
	ОбластьПодвал 			= Макет.ПолучитьОбласть("Подвал");
	
	ДанныеПечати = РезультатПоШапке.Выбрать();
	ДанныеПечати.Следующий();
	
	Если ЗначениеЗаполнено(ДанныеПечати.Контрагент) Тогда	
		Сведения = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ДанныеПечати.Контрагент, ДанныеПечати.Дата);
		ОбластьЗаголовок.Параметры.НаименованиеКонтрагента 		= Сведения.ПолноеНаименование; 
		ОбластьЗаголовок.Параметры.ИННКонтрагента 				= Сведения.ИНН;
		ОбластьЗаголовок.Параметры.КППКонтрагента 				= Сведения.КПП;
		ОбластьЗаголовок.Параметры.ЭлектронныйАдресТелефонКонтрагента 	= Сведения.ЭлектроннаяПочта 
																	+ ?(ЗначениеЗаполнено(Сведения.ЭлектроннаяПочта) И ЗначениеЗаполнено(Сведения.Телефоны), "/ ", "") 
																	+ Сведения.Телефоны; 
																	
		МассивПодстрокЮрАдреса = смартРазбитьСтрокуНаПодстроки(Сведения.ЮридическийАдрес, 60);	
		Для Индекс = 0 По Мин(МассивПодстрокЮрАдреса.Количество() - 1,2) Цикл
			ОбластьЗаголовок.Параметры["ЮридическийАдресКонтрагентаПодстрока" + Индекс]	= МассивПодстрокЮрАдреса[Индекс];
			Если Индекс < МассивПодстрокЮрАдреса.Количество() - 1 Тогда
				ОбластьЗаголовок.Параметры["ЮридическийАдресКонтрагентаПодстрока" + Индекс] = ОбластьЗаголовок.Параметры["ЮридическийАдресКонтрагентаПодстрока" + Индекс] + ",";	
			КонецЕсли;			
		КонецЦикла;
																	
		ОбластьПодвал.Параметры.НаименованиеКонтрагента 		= Сведения.ПолноеНаименование;
		Если ДанныеПечати.КонтрагентЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо Тогда
			ПолноеНаименование                      = ?(Лев(Сведения.ПолноеНаименование, 3) = "ИП ", Сред(Сведения.ПолноеНаименование, 4), Сведения.ПолноеНаименование); 
			ФИОФизическогоЛица 						= ФизическиеЛицаКлиентСервер.ЧастиИмени(СокрЛП(ПолноеНаименование));		
			ФамилияИнициалы 						= ФизическиеЛицаКлиентСервер.ФамилияИнициалы(ФИОФизическогоЛица); 
			ОбластьПодвал.Параметры.ФИОРуководителя = ФамилияИнициалы;
        КонецЕсли;
	КонецЕсли;
	
	ОбластьЗаголовок.Параметры.ДатаРегистрации = Формат(ДанныеПечати.ДатаРегистрации, "ДФ='dd.MM.yyyy ""г.""'"); 
	
	ОбластьЗаголовок.Параметры.Номер = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ДанныеПечати.Номер);
	ОбластьЗаголовок.Параметры.Дата	 = Формат(ДанныеПечати.Дата, "ДФ='dd.MM.yyyy ""г.""'"); 
	
	ТабличныйДокумент.Вывести(ОбластьЗаголовок);
	
	ПредставлениеУПД = "№ ________ от ___.___.20__ г.";
	ОснованияНаРеализацию = РезультатПоРеализациям.Выгрузить().ВыгрузитьКолонку("РеализацияТоваровУслугСсылка");
	РезультатАнализа = Документы.СчетФактураВыданный.ПолучитьСчетаФактурыНаПечать(ОснованияНаРеализацию);
	Если РезультатАнализа.СчетаФактурыНаПечать.Количество() > 0 Тогда
		ПредставленияУПД = Новый Массив;
		Для Каждого СчетФактураВыданныйСсылка Из РезультатАнализа.СчетаФактурыНаПечать Цикл 
			ПредставленияУПД.Добавить(СтрШаблон("№%1 от %2 г.", ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(СчетФактураВыданныйСсылка.Номер),
																Формат(СчетФактураВыданныйСсылка.Дата, "ДФ='dd.MM.yyyy'")));
		КонецЦикла;
		ПредставлениеУПД = СтрСоединить(ПредставленияУПД, ",");
	КонецЕсли;
	ОбластьЗаголовокУПД.Параметры.ПредставлениеУПД = ПредставлениеУПД;
	ТабличныйДокумент.Вывести(ОбластьЗаголовокУПД);
	
	ДанныеПечатиТовары = РезультатПоТабличнойЧасти.Выбрать();	
	Пока ДанныеПечатиТовары.Следующий() Цикл 
		Шаблон = "%1.   наименование %2, артикул %3, количество %4, стоимость %5 %6 в т.ч. НДС %7";
		ПредставлениеТовара = СтрШаблон(Шаблон,
										ДанныеПечатиТовары.НомерСтроки,
										ДанныеПечатиТовары.Номенклатура, 
										ДанныеПечатиТовары.Артикул, 
										ДанныеПечатиТовары.Количество,
										ДанныеПечатиТовары.Стоимость,
										ДанныеПечатиТовары.Валюта,
										ДанныеПечатиТовары.СтавкаНДС);
		ОбластьСтрокаТаблицы.Параметры.СтрокаТовара = ПредставлениеТовара;
		ЗаполнитьЗначенияСвойств(ОбластьСтрокаТаблицы.Параметры, ДанныеПечатиТовары);
		ТабличныйДокумент.Вывести(ОбластьСтрокаТаблицы);		
	КонецЦикла;	
	
	ТабличныйДокумент.Вывести(ОбластьПодвал);
	
КонецПроцедуры

Функция смартПолучитьДанныеДляПечатнойФормыПретензияДляПодписи(МассивОбъектов)
			
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПретензииКлиентов.Ссылка КАК Ссылка,
	|	ПретензииКлиентов.Основание КАК Основание,
	|	ПретензииКлиентов.ДатаРегистрации КАК ДатаРегистрации
	|ПОМЕСТИТЬ ВТ_Претензии
	|ИЗ
	|	Справочник.ПретензииКлиентов КАК ПретензииКлиентов
	|ГДЕ
	|	ПретензииКлиентов.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПретензииКлиентовсмартТовары.Ссылка КАК Ссылка,
	|	ПретензииКлиентовсмартТовары.НомерСтроки КАК НомерСтроки,
	|	ПретензииКлиентовсмартТовары.Номенклатура КАК Номенклатура,
	|	ПретензииКлиентовсмартТовары.Характеристика КАК Характеристика,
	|	ПретензииКлиентовсмартТовары.Количество КАК Количество,
	|	ПретензииКлиентовсмартТовары.Серия КАК Серия,
	|	ПретензииКлиентовсмартТовары.Ссылка.Основание КАК Основание
	|ПОМЕСТИТЬ ВТ_ТоварыПретензии
	|ИЗ
	|	Справочник.ПретензииКлиентов.смартТовары КАК ПретензииКлиентовсмартТовары
	|ГДЕ
	|	ПретензииКлиентовсмартТовары.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Претензии.ДатаРегистрации КАК ДатаРегистрации,
	|	Документы.Ссылка КАК Ссылка,
	|	Документы.Номер КАК Номер,
	|	Документы.Дата КАК Дата,
	|	Документы.Валюта КАК Валюта,
	|	Документы.Организация КАК Организация,
	|	Документы.Контрагент КАК Контрагент,
	|	Документы.Контрагент.ЮридическоеФизическоеЛицо КАК КонтрагентЮридическоеФизическоеЛицо
	|ИЗ
	|	ВТ_Претензии КАК ВТ_Претензии
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента КАК Документы
	|		ПО ВТ_Претензии.Основание = Документы.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаказКлиентаТовары.Ссылка КАК Ссылка,
	|	ЗаказКлиентаТовары.Номенклатура КАК Номенклатура,
	|	ЗаказКлиентаТовары.Характеристика КАК Характеристика,
	|	ЗаказКлиентаТовары.Серия КАК Серия,
	|	МАКСИМУМ(ЗаказКлиентаТовары.СуммаСНДС / ЗаказКлиентаТовары.КоличествоУпаковок) КАК ЦенаСНДССоСкидкой,
	|	ЗаказКлиентаТовары.СтавкаНДС КАК СтавкаНДС,
	|	ЗаказКлиентаТовары.Ссылка.Валюта КАК Валюта
	|ПОМЕСТИТЬ ВТ_ТоварыЗаказа
	|ИЗ
	|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
	|ГДЕ
	|	ЗаказКлиентаТовары.Ссылка В
	|			(ВЫБРАТЬ
	|				ВТ.Основание
	|			ИЗ
	|				ВТ_Претензии КАК ВТ)
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаказКлиентаТовары.Ссылка,
	|	ЗаказКлиентаТовары.Номенклатура,
	|	ЗаказКлиентаТовары.Характеристика,
	|	ЗаказКлиентаТовары.Серия,
	|	ЗаказКлиентаТовары.СтавкаНДС,
	|	ЗаказКлиентаТовары.Ссылка.Валюта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТоварыПретензии.НомерСтроки КАК НомерСтроки,
	|	ВТ_ТоварыЗаказа.Номенклатура.Наименование КАК Номенклатура,
	|	ВТ_ТоварыЗаказа.Номенклатура.Артикул КАК Артикул,
	|	ВТ_ТоварыПретензии.Количество КАК Количество,
	|	ВТ_ТоварыПретензии.Количество * ЕСТЬNULL(ВТ_ТоварыЗаказа.ЦенаСНДССоСкидкой, 0) КАК Стоимость,
	|	ЕСТЬNULL(ВТ_ТоварыЗаказа.СтавкаНДС, """") КАК СтавкаНДС,
	|	ЕСТЬNULL(ВТ_ТоварыЗаказа.Валюта, """") КАК Валюта
	|ИЗ
	|	ВТ_ТоварыПретензии КАК ВТ_ТоварыПретензии
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ТоварыЗаказа КАК ВТ_ТоварыЗаказа
	|		ПО ВТ_ТоварыПретензии.Номенклатура = ВТ_ТоварыЗаказа.Номенклатура
	|			И ВТ_ТоварыПретензии.Характеристика = ВТ_ТоварыЗаказа.Характеристика
	|			И ВТ_ТоварыПретензии.Серия = ВТ_ТоварыЗаказа.Серия
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РеализацияТоваровУслугТовары.Ссылка КАК РеализацияТоваровУслугСсылка
	|ИЗ
	|	ВТ_ТоварыПретензии КАК ВТ_ТоварыПретензии
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	|		ПО ВТ_ТоварыПретензии.Основание = РеализацияТоваровУслугТовары.ЗаказКлиента
	|			И ВТ_ТоварыПретензии.Номенклатура = РеализацияТоваровУслугТовары.Номенклатура
	|			И ВТ_ТоварыПретензии.Характеристика = РеализацияТоваровУслугТовары.Характеристика
	|			И ВТ_ТоварыПретензии.Серия = РеализацияТоваровУслугТовары.Серия";
	
	Если ТипЗнч(МассивОбъектов) = Тип("Массив") Тогда 
		Запрос.УстановитьПараметр("Ссылка", МассивОбъектов[МассивОбъектов.Количество() - 1]); 
	Иначе
		Запрос.УстановитьПараметр("Ссылка", МассивОбъектов.Основание);
	КонецЕсли;	
		
	ПакетРезультатовЗапроса = Запрос.ВыполнитьПакет();
	
	СтруктураДанныхДляПечати = Новый Структура;
	СтруктураДанныхДляПечати.Вставить("РезультатПоШапке", ПакетРезультатовЗапроса[2]);
	СтруктураДанныхДляПечати.Вставить("РезультатПоТабличнойЧасти", ПакетРезультатовЗапроса[ПакетРезультатовЗапроса.Количество() - 2]);
	СтруктураДанныхДляПечати.Вставить("РезультатПоРеализациям", ПакетРезультатовЗапроса[ПакетРезультатовЗапроса.Количество() - 1]);
	
	Возврат СтруктураДанныхДляПечати;
	
КонецФункции

Функция смартРазбитьСтрокуНаПодстроки(ТекстСтроки, МаксимальнаяДлинаСтрок)
	
	Результат 			= Новый Массив;
	МассивПодстрок 		= СтрРазделить(ТекстСтроки, ",");	
	ПодстрокаВРезультат = ""; 
	Для Каждого Подстрока Из МассивПодстрок Цикл
		Если СтрДлина(ПодстрокаВРезультат + ", " + Подстрока) <= МаксимальнаяДлинаСтрок Тогда
			ПодстрокаВРезультат = ПодстрокаВРезультат + ?(ЗначениеЗаполнено(ПодстрокаВРезультат), ", ", "") + СокрЛП(Подстрока);
		Иначе
			Результат.Добавить(ПодстрокаВРезультат);
			ПодстрокаВРезультат = Подстрока;
		КонецЕсли;		
	КонецЦикла;
	
	Если ЗначениеЗаполнено(ПодстрокаВРезультат) Тогда
		Результат.Добавить(ПодстрокаВРезультат);
	КонецЕсли;	
	
    Возврат Результат;

КонецФункции // РазбитьСтрокуНаПодстроки

//-- #3900 смарт: Тимофеева 06.08.2025
